#include "head.h"
#include <stdio.h>
#include <wchar.h>
#include <io.h>
#include <conio.h>
#include <stdlib.h>
#include <fcntl.h>
#include <windows.h>
#include <locale.h> 


void cat1() {
    FILE* filePointer;
    wchar_t singleLine[100]; // 유니코드 문자를 저장할 배열

    // 파일에 유니코드 입력
    setlocale(LC_CTYPE, "");
    setmode(_fileno(stdout), _O_U16TEXT);
    SetConsoleOutputCP(CP_UTF8);


    // 파일에 유니코드 입력
    filePointer = _wfopen(L"CAT.txt", L"w+, ccs=UTF-8");
    if (filePointer == NULL) {
        wprintf(L"파일을 열 수 없습니다.\n");
        return;
    }
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⠻⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡿⠁⠀⠘⢿⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶⠿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⡶⣶⣶⣦⣤⣀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⠃⠀⠀⠀⠈⣿⣧⣀⣀⡀⡀⠀⠀⢀⣼⠟⠀⠀⢹⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⡟⢋⠀⠀⠀⠀⠀⠉⠻⣷⣄⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣨⠟⠀⠀⠀⠀⠀⠈⠉⠙⠛⠻⠿⢿⢷⡿⡋⡀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⣸⡟⢠⠁⢀⣠⣤⣤⣀⠀⠀⠈⢿⡆⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⠏⠀⠀⠀⠀⣀⣤⣤⣄⡀⠀⠀⠢⣂⣢⡐⢌⠐⡅⠱⡀⢻⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡟⢐⠄⢣⣾⠏⠁⠉⣿⡆⠀⠀⣽⡏⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠉⠛⠓⠶⣤⣀⣾⠏⠀⠀⠀⠀⣼⢫⣶⣾⣮⢻⡀⢀⠼⣫⣍⡛⠻⣎⡐⠅⠪⡐⠻⣷⠀⠀⠀⢀⣀⣀⣀⣀⣄⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⣾⠃⠁⢰⣿⠃⠀⠀⠀⢺⣧⣀⣴⡿⠃⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣹⡿⡄⠀⠀⣴⠐⡇⢻⣿⣿⡿⣸⢇⡇⣾⣷⣾⣿⠀⢹⡇⡊⡢⠡⡑⣹⣦⠴⠞⠛⠋⠛⠙⡛⠛⠛⠛⠟⠿⣿⣶⣤⣀⠀⠀⠀⣿⠀⠀⣼⡟⠀⠀⠀⠀⠈⠙⠛⠉⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠖⠒⠓⠓⠖⠶⠶⣿⣇⠀⠀⠀⠿⢦⣽⣶⣭⣼⠶⠟⠾⣷⡘⠻⠟⢃⣠⣿⠣⣌⡶⢓⣥⡼⡷⠲⠒⠛⠛⠛⢛⠛⠣⡉⢌⠊⠔⡠⢉⠛⢿⣷⣄⢀⣷⠀⢀⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣯⠀⠀⠀⠀⠀⠀⠀⣬⡁⣚⡓⠌⠿⠿⠿⣿⣿⣭⣁⣼⠏⠨⠁⠆⣘⣿⣀⣀⣀⡨⣁⠅⡊⢢⢈⢂⠑⡌⠰⡠⠑⢄⠛⢿⣿⣿⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⡊⠛⡋⠻⢷⠿⠟⠀⠀⠀⠀⠈⠉⠀⠀⠈⠈⢉⣿⠈⠉⠉⠙⠛⠛⠷⡆⠢⡁⠪⡠⢑⠠⠃⠔⡡⢈⢿⣿⣇⣾⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⡇⠀⠀⠀⠀⠀⠀⠀⠈⠈⠐⠑⠐⠄⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠁⠑⢈⠆⡘⠔⡠⡁⡊⠜⡐⢄⠅⠄⢿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⠐⠔⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⠀⠀⠀⠀⠈⠐⠡⢂⢌⠐⢅⠨⢂⠘⡄⠹⣿⣿⡅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⡇⢊⠢⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⠴⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠢⢑⠄⠣⡈⠆⢌⠢⢻⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠰⣿⢅⠡⡊⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡾⠋⡠⢀⠄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠊⠢⠘⠄⠃⠀⢈⣿⣗⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⢸⡿⢀⠆⡡⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⡟⢡⢈⠂⢆⠨⢂⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⣯⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠀⡊⢔⣠⣤⣤⡀⠀⢀⣤⣤⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⢐⢁⠢⠑⢄⠃⡢⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⡿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⡠⠉⠉⠀⠀⠈⢹⣶⠟⠁⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠇⠤⡁⠪⡈⠢⡁⠪⡈⠢⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⡇⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡎⢐⠌⡂⡑⢌⠐⡅⡘⢄⠑⢅⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠒⠶⠶⣤⣴⠟⠁⠤⣀⡀⠀⠀⠀⠀⠀⢀⣀⣤⣤⣤⣤⣼⣿⣷⣤⣊⡔⡈⠢⢂⠌⡂⡑⠔⡐⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠙⠓⠓⠛⠛⠋⠉⠀⠀⠀⠁⠈⠈⠉⠻⣻⠿⢁⠕⡐⢌⢐⢌⡢⣁⣀⣀⣀⣀⣄⣤⣤⣤⣴⡶⠿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠿⠳⠿⠻⠟⠟⠛⠛⠛⠛⠛⠙⠉⠉⠉⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");


    // 파일에서 한 줄씩 읽어오기
     rewind(filePointer); // 파일 포인터를 파일의 시작으로 이동
    while (fgetws(singleLine, sizeof(singleLine) / sizeof(wchar_t), filePointer) != NULL) {
        wprintf(L"%s", singleLine); // 유니코드 문자 출력
    }



    // 파일 닫기
    fclose(filePointer);
    _setmode(_fileno(stdout), _O_TEXT); // 텍스트 출력 모드로 변경
    _getch();
    system("cls");

    id(); // id() 함수 호출
}


void cat2() {
    FILE* filePointer;
    wchar_t singleLine[100]; // 유니코드 문자를 저장할 배열

    // 파일에 유니코드 입력
    setlocale(LC_CTYPE, "");
    setmode(_fileno(stdout), _O_U16TEXT);
    SetConsoleOutputCP(CP_UTF8);


    // 파일에 유니코드 입력
    filePointer = _wfopen(L"CAT.txt", L"w+, ccs=UTF-8");
    if (filePointer == NULL) {
        wprintf(L"파일을 열 수 없습니다.\n");
        return;
    }
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡾⠿⢿⣦⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡈⠄⢂⠰⣿⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣶⣦⣄⠀⠀⠀⠀⠀⠀⠀⣰⡿⢷⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣧⠈⠤⣘⡿⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⠋⠻⢿⣦⠀⠀⠀⠀⠀⠀⣿⡇⠈⢿⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢨⣿⠀⠀⣿⣏⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⠇⠀⠀⠈⢿⣧⡀⠀⠀⠀⢸⣿⠀⠀⠈⢿⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠄⢂⡐⢛⡇⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡟⠀⠀⠀⠀⣈⠿⣷⣀⣀⣀⣿⡯⠀⠀⠀⠈⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⢐⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡾⠋⠁⠀⠀⠀⠀⢀⠢⠄⡉⠛⠛⠋⠁⠀⠀⠀⠀⠘⠿⣆⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⠂⠌⡀⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⠟⠀⠀⠀⠀⠀⠀⠀⠄⠀⠂⠠⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢺⡇⠀⢐⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⡄⠀⠀⠀⠀⠀⠀⠀⣀⣠⣤⣤⣶⣶⣶⣶⣶⣤⣽⡂⠀⠸⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⠇⠀⠀⠐⠿⣦⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⡇⠀⠀⠀⠀⣠⣶⡿⢛⠋⠍⢡⠠⠐⡈⢉⠋⠩⡙⢿⣿⣷⡀⣿⣏⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⣄⢰⡄⠙⠻⣦⠀⣦⣠⣄⡄⢀⣤⠶⠟⡿⠿⠿⠿⠂⠀⠀⠀⢸⣏⠀⠀⣠⣾⠟⠉⡐⠄⠊⠌⣀⠂⠡⠌⠠⠌⠡⠐⠀⠙⣿⣿⣽⡗⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠙⢿⣧⣤⣤⣤⣼⣏⡉⢹⣧⣈⣄⣠⣠⡏⣀⣤⣤⠄⠀⠀⠀⣸⠇⣠⣾⠟⠁⠀⢐⡈⠔⡉⠀⠄⡈⢡⠈⠡⢈⠐⠡⠀⠀⠸⣿⣿⣟⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣧⠀⠛⠻⠷⠂⠀⠐⢶⣶⣿⣿⣮⡭⠉⠉⠉⠉⠁⢉⣁⣀⡀⠀⠀⣰⣿⣴⠟⠁⠀⠀⠀⢂⡐⢂⠀⠀⢂⢁⠂⠀⠅⠂⡌⠡⠀⠀⠀⢻⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣷⣤⠾⠋⠁⠀⠀⠈⠻⣿⣿⠿⠃⠀⠀⠀⠀⠀⢬⡉⠉⠁⠀⣰⡿⠋⠀⠀⠀⠀⠀⠀⢂⠔⠂⠀⠈⠄⢂⠡⠀⢊⠡⢀⡁⠀⠀⠀⠸⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠿⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠛⠶⠀⡾⠟⠁⠀⠀⠀⠀⠀⠀⠀⠌⠠⠀⠀⠀⠌⡐⠀⠀⠂⠤⢁⠀⠀⠀⠀⠀⢿⣿⡇⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠿⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠛⠶⠀⡾⠟⠁⠀⠀⠀⠀⠀⠀⠀⠌⠠⠀⠀⠀⠌⡐⠀⠀⠂⠤⢁⠀⠀⠀⠀⠀⢿⣿⡇⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠲⠦⢤⡤⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠐⠈⠀⠀⠈⠐⠀⠀⠀⠀⠀⠀⠸⣿⣿⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣧⣴⣶⣿⡿⠋⠉⠀⠀⠀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⠏⠈⣷⡀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⢃⣤⣾⣿⡿⠋⠀⠀⠀⠀⠀⠈⣽⣿⠇⠀⠀⠀⠀⠀⣠⣴⣾⡿⠿⠟⠛⠛⠋⠙⠉⠉⠁⠀⠀⠀⠈⠻⣿⣦⡄⠈⣿⣗⠀⠀⠀⠀⠀⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⣿⣿⣿⣿⠿⠛⠉⠀⠀⠀⠀⠀⠀⠀⣴⣿⠟⠀⠀⠀⣠⣿⡿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣿⣄⣿⣿⠀⠀⠀⠀⢸⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⡿⠃⠀⠀⣠⣾⣿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⠀⠀⠀⣰⣿⠏⠈⣷⡀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣿⠟⠁⢀⣤⣾⡿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⠃⠀⠀⢰⣿⣿⡄⠀⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣧⣴⣶⣿⡿⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⠃⠀⣀⣴⣿⠏⠘⣷⣤⣿⠇⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣧⣴⣾⡿⠛⠁⠀⠈⢿⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠙⠉⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");

    // 파일에서 한 줄씩 읽어오기
    rewind(filePointer); // 파일 포인터를 파일의 시작으로 이동
    while (fgetws(singleLine, sizeof(singleLine) / sizeof(wchar_t), filePointer) != NULL) {
        wprintf(L"%s", singleLine); // 유니코드 문자 출력
    }



    // 파일 닫기
    fclose(filePointer);
    _setmode(_fileno(stdout), _O_TEXT); // 텍스트 출력 모드로 변경
    _getch();
    system("cls");

    id(); // id() 함수 호출
}

void cat3() {
    FILE* filePointer;
    wchar_t singleLine[100]; // 유니코드 문자를 저장할 배열

    // 파일에 유니코드 입력
    setlocale(LC_CTYPE, "");
    setmode(_fileno(stdout), _O_U16TEXT);
    SetConsoleOutputCP(CP_UTF8);


    // 파일에 유니코드 입력
    filePointer = _wfopen(L"CAT.txt", L"w+, ccs=UTF-8");
    if (filePointer == NULL) {
        wprintf(L"파일을 열 수 없습니다.\n");
        return;
    }
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⠻⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣤⣤⣀⠀⠀⠀⠀⠀⠀⣠⣿⡏⠀⢻⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⢿⣿⣿⣶⣤⣤⣶⣶⣶⣾⣿⣿⣷⣤⣼⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣬⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⣿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⡿⠋⢭⣭⡙⢿⣿⣿⡏⡂⣹⣿⣇⢻⣿⣿⣿⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣾⣿⣿⣿⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⡇⣦⣼⣿⣿⡆⣿⣿⡘⣿⣿⣿⣿⢸⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣧⠹⣿⣿⣿⡇⣾⢿⣧⣈⣛⣋⣵⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⡟⠛⠻⣿⣿⣿⣿⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣷⣬⣭⣵⣾⣫⣬⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⠀⠀⠀⠹⣿⣿⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠀⠀⠀⠀⠀⠀⢀⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣯⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣤⣾⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⣿⡟⢹⣿⣿⣿⣿⣿⢝⣿⣿⣿⠀⣿⣿⣿⣿⡏⢹⣿⣿⣿⣿⣿⣿⣿⠟⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⢿⣿⣿⣿⣿⣇⢸⣿⡇⠀⣿⣿⣿⣿⡇⣼⣿⣿⡿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣇⠸⣿⣿⣿⣿⣿⠀⣼⣿⣿⣿⣿⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    fwprintf(filePointer, L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⠢⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀⠀                                   ⠀\n");
    // 파일에서 한 줄씩 읽어오기
    rewind(filePointer); // 파일 포인터를 파일의 시작으로 이동
    while (fgetws(singleLine, sizeof(singleLine) / sizeof(wchar_t), filePointer) != NULL) {
        wprintf(L"%s", singleLine); // 유니코드 문자 출력
    }



    // 파일 닫기
    fclose(filePointer);
    _setmode(_fileno(stdout), _O_TEXT); // 텍스트 출력 모드로 변경
    _getch();
    system("cls");

    id(); // id() 함수 호출
}
