#include"head.h"
#include <stdio.h>
#include <windows.h>

void cat1() {
	printf("나는야 고양이 1\n");
	system("cls"); id();
}
void cat2() {
	printf("나는야 고양이 2\n");
	system("cls"); id();
}
void cat3() {
	printf("나는야 고양이 3\n");
	system("cls"); id();
}




void choice_cat()
{
	int selMenu;

	printf("   +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n");
	printf("   *********************************************************************************************\n");
	printf("   +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n");
	printf("   *******************          고양이를 선택하세요            ********************\n\n");

	printf("   *********************************************************************************************\n");
	printf("   +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n");
	printf("   *********************************************************************************************\n\n\n\n\n");

	printf("                           ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
	printf("                           ┃            고양이 선택            ┃\n");
	printf("                           ┃                                   ┃\n");
	printf("                           ┃            1. 1번 고양이          ┃\n");
	printf("                           ┃            2. 2번 고양이          ┃\n");
	printf("                           ┃            3. 3번 고양이          ┃\n");
	printf("                           ┗━━━━━━━━━━-━━━━━━━━━━━━━━━-━━━━━━━━┛\n");
	printf("                                ▲  고양이를 선택하세요 ▲ ");
	scanf("%d", &selMenu);

	if (selMenu == 1) { system("cls");  cat1(); }
	if (selMenu == 2) { system("cls"); cat2(); }
	if (selMenu == 3) { system("cls"); cat3(); }



}


void gotoxy(int x, int y)
{
	COORD pos = { x, y };
	SetConsoleCursorPosition(GetStdHandle(STD_OUTPUT_HANDLE), pos);
}
