#include"head.h"
#include <stdio.h>
#include <windows.h>
#include <locale.h> 
#include <io.h>
#include <fcntl.h>

void shop()
{
	int selMenu, currentSnack;

	// 파일에서 이전 점수 읽어오기
	FILE* file = fopen("score.txt", "r");
	if (file != NULL) {
		fscanf(file, "%d", &currentSnack);
		fclose(file);
	}
	else {
		printf(" 새로운 파일\n");
		// 파일을 열 수 없을 경우 기본 점수 0으로 설정
	}

	printf("                                                                                    현재 보유하고 있는 간식 수: %d개\n", currentSnack);
	printf("                                       ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
	printf("                                       ┃           상점 메뉴 선택          ┃\n");
	printf("                                       ┃                                   ┃\n");
	printf("                                       ┃         1. 모자 구매하기          ┃\n");
	printf("                                       ┃         2. 안경 구매하기          ┃\n");
	printf("                                       ┃           3. 간식 주기            ┃\n");
	printf("                                       ┃     4. 메인화면으로 돌아가기      ┃\n");
	printf("                                       ┗━━━━━━━━━━-━━━━━━━━━━━━━━━-━━━━━━━━┛\n");
	printf("                                           ▲  원하는 메뉴를 선택하세요 ▲ ");
	scanf("%d", &selMenu);

	if (selMenu == 1) { system("cls"); hat_shop(); }
	if (selMenu == 2) { system("cls"); glasses_shop(); }
	if (selMenu == 3) { system("cls"); snack(); }
	if (selMenu == 4) { system("cls"); title(); }



}

void hat_shop()
{
	int selHat;
	int	currentSnack;

	// 파일에서 이전 점수 읽어오기
	FILE* file = fopen("score.txt", "r");
	if (file != NULL) {
		fscanf(file, "%d", &currentSnack);
		fclose(file);
	}
	else {
		printf(" 새로운 파일\n");
		// 파일을 열 수 없을 경우 기본 점수 0으로 설정
	}

	printf("                                                                                    현재 보유하고 있는 간식 수: %d개\n", currentSnack);
	printf("                                       ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
	printf("                                       ┃           모자 구매하기           ┃\n");
	printf("                                       ┃                                   ┃\n");
	printf("                                       ┃       1. 마법사 모자 구매하기     ┃\n");
	printf("                                       ┃         2. 왕관 구매하기          ┃\n");
	printf("                                       ┃        3. 상점으로 돌아가기       ┃\n");
	printf("                                       ┗━━━━━━━━━━-━━━━━━━━━━━━━━━-━━━━━━━━┛\n");
	printf("                                           ▲  원하는 메뉴를 선택하세요 ▲ ");
	scanf("%d", &selHat);
	if (selHat == 1) { system("cls"); magic_hat(); }
	if (selHat == 2) { system("cls"); crown(); }
	if (selHat == 3) { system("cls"); shop(); }
}

void glasses_shop(){

	int buyGlasses;
	int	currentSnack;

	// 파일에서 이전 점수 읽어오기
	FILE* file = fopen("score.txt", "r");
	if (file != NULL) {
		fscanf(file, "%d", &currentSnack);
		fclose(file);
	}
	else {
		printf(" 새로운 파일\n");
		// 파일을 열 수 없을 경우 기본 점수 0으로 설정
	}

	printf("                                                                                    현재 보유하고 있는 간식 수: %d개\n", currentSnack);
	setlocale(LC_CTYPE, "");
	_setmode(_fileno(stdout), _O_U16TEXT); // Call this before writing anything
	wprintf(L"⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣷⣦⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣷⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⡏⠈⠉⠛⠿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⠋⠻⣿⣿⣶⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⢀⠀⠀⢀⣴⣿⡿⠁⠀⠀⠈⠙⠟⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⢠⣶⣶⣶⣶⣶⣿⣿⣿⣿⣿⣿⣿⢿⣿⣦⣾⣿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⡟⡀⣀⣀⣠⣤⣶⣶⣶⣷⢾⠾⠿⠿⠿⣿⣇⠀⠀⠀⣸⣿⠉⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⣹⣿⣿⣿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⢿⠟⠟⠛⠛⠙⠉⠈⠀⠀⠀⠀⠀⢐⣿⣷⣠⣴⣶⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣺⣿⡿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⡿⠛⠛⠉⣿⣿⠀⠀⠀⠀⠀⡀⡀⡀⣀⣀⣀⣾⣿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡗⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢨⣿⡯⠀⠀⠀⣿⣿⣾⣾⣾⣿⣿⣿⣿⣿⢿⡿⣿⣿⠿⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣯⣴⣶⣶⣶⣶⣾⣶⣶⣶⣶⣶⣷⣿⣿⡿⡗⠀⠀⠀⠛⠋⠉⠉⠈⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠿⠿⠟⠛⠙⠙⠉⠉⠉⠉⠉⠉⠉⠉⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");

	_setmode(_fileno(stdout), _O_TEXT);

	printf("                  안경 구매를 진행하겠습니까? (Y/N) : ");
	scanf(" %c", &buyGlasses);


}

void magic_hat()
{
	int buyHat;
	int	currentSnack;

	// 파일에서 이전 점수 읽어오기
	FILE* file = fopen("score.txt", "r");
	if (file != NULL) {
		fscanf(file, "%d", &currentSnack);
		fclose(file);
	}
	else {
		printf(" 새로운 파일\n");
		// 파일을 열 수 없을 경우 기본 점수 0으로 설정
	}

	printf("                                                                                    현재 보유하고 있는 간식 수: %d개\n", currentSnack);
	setlocale(LC_CTYPE, "");
	_setmode(_fileno(stdout), _O_U16TEXT); // Call this before writing anything
	wprintf(L"⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⡞⠛⠙⡉⠛⢛⠳⠷⠶⣦⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⡟⢑⠀⡁⠡⢀⠡⠐⢀⠂⠄⠄⡈⠙⠛⠷⢶⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⡿⠃⡈⠄⠂⡁⠌⡀⠅⡀⢂⠐⡈⠠⢈⠠⠐⢈⣠⣥⣦⢶⠾⠞⠛⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⡟⠐⡀⠂⠄⢂⠐⡀⢂⠠⠀⠅⠐⡀⠅⠨⠐⢐⠀⢂⠡⠈⠄⠂⡈⢉⠛⠻⢶⣦⣤⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⠏⠐⢈⠐⡀⠂⠄⢂⠐⠠⠀⠄⡐⢀⠂⠡⠈⠄⢐⠠⠐⠈⢺⣏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⠋⠄⢐⠠⠐⠠⢈⠐⡀⢂⠐⡀⠌⡀⠅⡈⠄⠂⡈⢐⠠⢹⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⠏⠠⠁⠄⢂⠨⠀⢂⢐⢠⣐⣠⣐⣠⣔⣤⣴⣴⣵⣴⣶⣲⣶⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⠇⣠⣬⡦⡾⢶⠷⣻⢻⡛⡏⡏⡏⡏⡏⡝⡍⡇⡇⡇⡇⡎⡎⡎⡞⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⡟⡭⡣⡣⣪⢪⢣⢝⢔⢕⣕⣕⣝⣼⣼⣼⣮⣾⣼⣮⣾⣼⣾⣾⣺⣾⣾⣿⣆⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⣾⣿⠟⢉⠋⡉⢐⠠⠐⢀⠂⢂⠨⠀⢂⠨⠐⠀⠄⡐⢀⠂⠡⠈⠄⢐⠠⠐⠐⡀⠅⠂⡐⢈⠠⠠⠈⢛⠻⣿⣶⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠶⣿⣿⣍⣔⣈⣄⣂⣐⣀⣅⣀⣂⣄⣂⣄⣂⣨⣀⣂⣐⣈⡠⣁⢌⣠⣁⣢⣔⣤⡦⠷⠾⠞⠞⠛⠛⠋⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠈⠈⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠋⠉⠉⠉⠁⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");

	_setmode(_fileno(stdout), _O_TEXT);
	
	printf("                마법사 모자 구매를 진행하겠습니까? (Y/N) : ");
	scanf(" %c", &buyHat);
	

}
		

void crown()
{ 
	int buyCrown;
	int	currentSnack;

	// 파일에서 이전 점수 읽어오기
	FILE* file = fopen("score.txt", "r");
	if (file != NULL) {
		fscanf(file, "%d", &currentSnack);
		fclose(file);
	}
	else {
		printf(" 새로운 파일\n");
		// 파일을 열 수 없을 경우 기본 점수 0으로 설정
	}

	printf("                                                                                    현재 보유하고 있는 간식 수: %d개\n", currentSnack);
	setlocale(LC_CTYPE, "");
	_setmode(_fileno(stdout), _O_U16TEXT); // Call this before writing anything
	wprintf(L"⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⡟⡈⠻⣿⣿⣷⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⡿⠐⡀⢂⠨⠹⢿⣿⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣶⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⠃⢂⠐⡀⠂⠄⢑⢻⣿⣿⣧⣄⠀⠀⠀⠀⣠⣾⣿⢟⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⣿⡏⠌⡀⠂⠄⠡⠈⠄⡀⠻⢿⣿⣿⣷⡀⣠⣾⣿⢟⠡⢀⣿⣿⣿⣿⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣦⣀⡀⡀⠀⠀⠀⠀⣾⣿⣿⡟⢐⢀⣢⣡⣮⣦⣁⠂⡐⢈⠈⠻⣿⣿⣿⣿⠟⡑⢀⠂⠄⢿⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⢿⣿⣿⣷⣷⣶⣤⣤⣿⣿⠟⠐⢰⣿⣿⠟⠙⠿⣿⣷⣦⠂⡈⠄⡈⠍⠩⠐⡀⢂⠐⠠⠈⢺⣿⣿⣏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⡥⠠⠀⠅⡉⠛⠻⠿⡿⠣⠁⠌⡈⣾⡗⠀⠀⠀⠙⣿⣿⡂⡐⢀⠂⠨⢀⠡⠐⡀⠌⠠⠁⢜⣿⣿⣗⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠨⣿⣿⣿⠠⠁⠂⠄⠡⠈⠄⢂⠨⢀⠡⠨⣿⡆⠀⠀⠀⠀⢺⣿⡃⠄⢂⢈⠐⡀⢂⠡⠐⡈⠄⠡⢘⣿⣿⡷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⡅⠨⠀⠅⠨⢀⠡⠀⡂⠄⢂⠈⣿⣇⠀⠀⠀⠀⣺⣿⠅⢂⠐⡀⢂⠐⡀⢂⠡⠐⡈⢐⠨⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢺⣿⣿⣇⠌⠠⠁⠌⡀⢂⠡⠀⠌⠠⠈⣻⣿⣆⡀⣀⣶⣿⠣⠈⠄⢂⠐⡀⢂⠐⡀⢂⢁⢐⣠⣼⣿⣿⡛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⣷⡈⠄⢁⠂⡐⢀⠂⠡⠈⠄⠡⢈⢐⣀⣂⣔⣄⣦⣵⣶⣿⣿⣿⣿⢿⠿⠻⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠨⢿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⡿⠿⠻⠛⠝⠉⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
	wprintf(L"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀                      ⠀⠀⠀⠀⠀\n");

	_setmode(_fileno(stdout), _O_TEXT);

	printf("                왕관 구매를 진행하겠습니까? (Y/N) : ");
	scanf(" %c", &buyCrown);

}

void snack() {
	int	currentSnack;

	// 파일에서 이전 점수 읽어오기
	FILE* file = fopen("score.txt", "r");
	if (file != NULL) {
		fscanf(file, "%d", &currentSnack);
		fclose(file);
	}
	else {
		printf(" 새로운 파일\n");
		// 파일을 열 수 없을 경우 기본 점수 0으로 설정
	}

	printf("                                                                                    현재 보유하고 있는 간식 수: %d개\n", currentSnack);
	printf("고양이에게 간식 주기\n");
}